# Салам уебки! Сегодня порешаем 16-ые задачки.
# Помимо новых задачек, закину еще парочку для повторения (вы сами просили)


# Задание 1
# 5245 (№16 в ЕГЭ)

# Задание 2
# 4657 (№16 в ЕГЭ)

# Задание 3
# 33504 (№2 в ЕГЭ)

# Задание 4
# 28542 (№5 в ЕГЭ)

# Задание 5
# 37371 (№17 в ЕГЭ)

# Extra задание
# Напишите рекурсивный вариант бинарного поиска (поиск элемента в отсортированном массиве)
# Внимательно изучите работу бинарного поиска, чтобы понять как его реализовать
# Я понимаю что скорее всего вы скатаете, но мне пиздец как важно чтоб вы поняли этот алгоритм.
# Это самая база. Прям базовее некуда. Потрените еще заодно понимание рекурсии)))
